t=input()
if t=='걸.걸.걸':
    print('더 사랑할걸, 더 참을걸, 더 즐길걸.')
elif t=='사.우.나':
    print('사랑과 우정을 나누자')
elif t=='오.징.어':
    print('오래도록 징그럽게 어울리자')
elif t=='사.이.다':
    print('사랑하자 이 세상 다 바쳐')
elif t=='나.가.자':
    print('나라, 가정, 자신의 발전을 위하여')
elif t=='재.개.발':
    print('재미있고 개성있게 발전적으로 살자')
elif t=='우.아.미':
    print('우아하고 아름다운 미래를 위하여')
elif t=='이.기.자':
    print('이런 기회를 자주 만들자')
elif t=='청.바.지':
    print('청춘은 바로 지금부터')
elif t=='지.화.자':
    print('지금부터 화합하자')
elif t=='해.당.화':
    print('해가 갈수록 당당하고 화려하게')
elif t=='재.건.축':
    print('재미있고 건강하게, 축복하며 살자')
elif t=='주.전.자':
    print('주인의식을 갖고 전문성을 갖추고 자신있게 살자')
elif t=='거.시.기':
    print('거절하지 말고 시키는 대로 기쁘게')
elif t=='남.존.여.비':
    print('남자가 존재하는 이유는 여자의 비위를 맞추기 위해')
elif t=='우.하.하':
    print('우리는 하늘 아래 하나다')
elif t=='당.신.멋.져':
    print('당당하게 살자,신바람나게 살자,멋지게 살자,져주며 살자')
elif t=='당.나.귀':
    print('당신과 나의 귀한 만남')
elif t=='빠.삐.용':
    print('빠지거나,삐지거나,따지면 용서하지 않는다')
elif t=='오.바.마':
    print('오늘은 바래다 줄께 마시자')
elif t=='올.파.파':
    print('올해에도 파이팅하고 파이팅합시다')
elif t=='니.나.노':
    print('니랑 나랑 노래하고 춤 추자')
elif t=='고.사.리':
    print('고맙습니다, 사랑합니다, 이해합니다')
elif t=='오.행.시':
    print('오늘도 행복한 시간을 되세요')